БухЭксп/InformationRegisters/CW_ПользователиВебПрофилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПользователиВебПрофилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВебПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиЗаявок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофилиПеревозок</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Comment>"ГРУЗОПЕРЕВОЗКИ", "ЗАЯВКИ"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПользователиВебПрофилей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УдалитьЗаписьПрофилей(СтруктураОтбора) Экспорт
	
	НаборЗаписей = РегистрыСведений.CW_ПользователиВебПрофилей.СоздатьНаборЗаписей();
	
	Для Каждого КлючЗначение из СтруктураОтбора Цикл
		НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры   

Процедура ЗаполнитьРазделПрофилейПользователя() Экспорт    
	
	НаборЗаписей = РегистрыСведений.CW_ПользователиВебПрофилей.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для Каждого СтрокаНабора из НаборЗаписей Цикл 
		Если ТипЗнч(СтрокаНабора.ВебПрофиль) = Тип("СправочникСсылка.CW_ВебПрофили") Тогда
			СтрокаНабора.ОсновнойПрофиль = СтрокаНабора.ВебПрофиль.ОсновнойПрофиль;                                                   
		КонецЕсли;  
		СтрокаНабора.Раздел = "ГРУЗОПЕРЕВОЗКИ"; 
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецЕсли
